README.org
#+TITLE: My literate Emacs Configuration
#+AUTHOR: Marcus
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
#+REVEAL_INIT_OPTIONS: slideNumber:true
#+REVEAL_THEME: league
#+REVEAL_HIGHLIGHT_CSS: https://unpkg.com/@highlightjs/cdn-assets@11.9.0/styles/nord.css
#+REVEAL_PLUGINS: (highlight)

* Emacs Configuration 
:PROPERTIES:
:CUSTOM_ID: emacs-configuration
:ID:       87291F55-9407-4438-9CE4-67DFC36DACB5
:END:
=WARNING=

This is my personal Emacs configuration. It is a work in progress. The relavant
configuration files are tangled from this Org-document (=C-c C-v t=). I don't
tangle on save or anything like that. This is a work in progress and will never
be done. This is a rabbit hole...

I regulary commit my configuration to github even though it is not working. Yes,
I know, I shouldn't but I do so you have been warned.

*Here be dragons*

If you are looking for insperation, check out these instead:
- [[https://sachachua.com/blog/][Sacha Chua's Living an awesome life]]
- [[https://protesilaos.com/][Protesilaos Stavrou's personal website]]
- [[https://www.spacemacs.org/][Spacemacs - a community-driven Emacs distribution]]
- [[https://github.com/doomemacs/doomemacs][Doom Emacs - a configuration framework for Emacs]]

If you want to learn more about Org:
- [[https://orgmode.org/manual/index.html][The Org manual]]
- [[https://www.gnu.org/software/emacs/tour/][A guided tour of Emacs]]
- [[https://www.gnu.org/software/emacs/manual/index.html][GNU Emacs Manuals Online]]
  
* Table of Contents
:PROPERTIES:
:TOC:      :include all :depth 4 :ignore (this) 
:ID:       C7943AE1-FE55-46C9-AEC1-F28F84970B23
:END:
:CONTENTS:
- [[#emacs-configuration][Emacs Configuration]]
- [[#generate-files-and-file-headers][Generate files and file headers]]
  - [[#initel][init.el]]
  - [[#early-initel][early-init.el]]
  - [[#customel][custom.el]]
  - [[#aliases][Aliases]]
  - [[#profile][Profile]]
- [[#put-stuff-in-early-initel][Put stuff in early-init.el]]
  - [[#garbage-collection][Garbage collection]]
- [[#package-manager][Package Manager]]
- [[#macos-specifics][MacOS Specifics]]
  - [[#exec-path-from-shell][Exec path from shell]]
  - [[#macos-keyboard-settings][MacOS keyboard settings]]
- [[#misc-settings][Misc settings]]
- [[#look-and-feel][Look and Feel]]
  - [[#minibuffer][Minibuffer]]
    - [[#which-key][Which key]]
    - [[#vertico][Vertico]]
    - [[#save-history][Save history]]
    - [[#marginalia][Marginalia]]
    - [[#orderless][Orderless]]
    - [[#emacs-minibuffer-configurations][Emacs minibuffer configurations]]
  - [[#themes-modeline-and-fonts][Themes, modeline and Fonts]]
    - [[#ef-themes][EF-themes]]
    - [[#doom-themes][Doom Themes]]
    - [[#modeline][Modeline]]
    - [[#fonts][Fonts]]
    - [[#where-is-my-cursor][Where is my cursor]]
    - [[#icons][Icons]]
    - [[#windows][Windows]]
- [[#keybindings][Keybindings]]
  - [[#evil][Evil]]
  - [[#my-personal-key-bindings][My personal key bindings]]
  - [[#ivy-and-counsel][IVY and Counsel]]
  - [[#general-key-binding][General key binding]]
  - [[#helpful][Helpful]]
  - [[#move-text][Move text]]
  - [[#tldr][TLDR]]
- [[#programming][Programming]]
  - [[#version-control][Version control]]
    - [[#magit][Magit]]
  - [[#code-completion][Code completion]]
    - [[#corfu][Corfu]]
    - [[#cape][Cape]]
  - [[#project-management][Project management]]
    - [[#projectile][Projectile]]
- [[#org][Org]]
  - [[#org-0][Org]]
  - [[#org-make-toc][Org make-toc]]
  - [[#org-reveal][Org reveal]]
    - [[#htmlize][Htmlize]]
  - [[#org-tempo][Org tempo]]
  - [[#org-bullets][Org bullets]]
- [[#internet][Internet]]
  - [[#browse-url][Browse URL]]
  - [[#elfeed][Elfeed]]
- [[#shells-and-terminals][Shells and terminals]]
  - [[#eshell][Eshell]]
:END:

* Generate files and file headers
:PROPERTIES:
:CUSTOM_ID: generate-files-and-file-headers
:ID:       15430D8A-669B-4FAD-A3A5-E7EF438CFD33
:END:
The file headers sets [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Lexical-Binding.html][lexical-binding]] to true. I also try to warn people not to
use this configuration as is.

*Here be dragons*

** init.el
:PROPERTIES:
:CUSTOM_ID: initel
:ID:       C784E801-08CA-4669-8BBD-E79995DA6869
:END:
Header text and [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Lexical-Binding.html][lexical binding]].

#+begin_src emacs-lisp :tangle init.el
;;; init.el -*- lexical-binding: t; -*-

;;; Commentary:
;; This is my personal Emacs configuration. The file is tangled from a
;; literate org document where I try to document what each piece is for.
;; If you found my configurations you are free to use as you please, but
;; please read the whole thing before you do. I regulary commit my
;; configuration even though it is not working. Yes, I know, you shouldn't
;; do that but you have been warned.

;; Here be dragons

;; Code:
#+end_src

** early-init.el
:PROPERTIES:
:CUSTOM_ID: early-initel
:ID:       40842719-67BD-4940-B894-61C927D529B3
:END:
Header text and [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Lexical-Binding.html][lexical binding]].

#+begin_src emacs-lisp :tangle early-init.el
;;; early-init.el -*- lexical-binding: t; -*-

;;; Commentary:
;; This is my personal Emacs configuration. The file is tangled from a
;; literate org document where I try to document what each piece is for.
;; If you found my configurations you are free to use as you please, but
;; please read the whole thing before you do. I regulary commit my
;; configuration even though it is not working. Yes, I know, you shouldn't
;; do that but you have been warned.

;; Here be dragons

;; Code:
#+end_src

** custom.el
:PROPERTIES:
:CUSTOM_ID: customel
:ID:       C8237143-D3B4-4A1F-AD20-F1B6A0B9324D
:END:
In Emacs, a custom file is used to store customization settings seperately
from the main init file, allowing for easier management of user preferences.
I use this literate org-file but I like to separate the preferences all the same.

#+begin_src emacs-lisp :tangle init.el
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
  (when (file-exists-p custom-file)
    (load custom-file))
#+end_src

** Aliases
:PROPERTIES:
:CUSTOM_ID: aliases
:ID:       F5DE7D60-F62C-4EE4-91FF-F3A22DD8AD2B
:END:
#+begin_src bash :tangle eshell/aliases
  # alias for emacs commands
  alias ff find-file $1

  # aliasing standard shell commands to better emacs alternatives
  alias less view-file $1

  # using exa instead of ls
  alias ls eza -al --color=always --group-directories-first $*   # my prefered listing
  alias la eza -a --color=always --group-directories-first $*    # all files and directories
  alias ll eza -l --color=always --group-directories-first $*    # long format
  alias lt eza -aT --color=always --group-directories-first $*   # tree listing
  alias l. eza -a1 $* | grep "^\."                               # list hidden files
#+end_src

** Profile
:PROPERTIES:
:CUSTOM_ID: profile
:ID:       83FC4DED-47A6-40B8-BEE4-95AFCBAC73FF
:END:
#+begin_src bash :tangle eshell/profiles
  # I had a thought what to put in here but it eluded me
#+end_src

* Put stuff in early-init.el
:PROPERTIES:
:ID:       F46F08A4-309D-47DA-B246-23E70D9B935D
:CUSTOM_ID: put-stuff-in-early-initel
:END:
** Garbage collection
:PROPERTIES:
:ID:       6E4C54B3-EEB2-4F4D-B34F-FCDFD1D0C789
:CUSTOM_ID: garbage-collection
:END:
#+begin_src emacs-lisp :tangle early-init.el
  (setq gc-cons-theshold 64000000)
  (add-hook 'after-init-hook #'(lambda () (setq gc-cons-threshold 800000)))
#+end_src

* Package Manager
:PROPERTIES:
:CUSTOM_ID: package-manager
:ID:       57431B1C-2313-47DC-85FD-E5787A494314
:END:
[[https://www.gnu.org/software/emacs/manual/html_node/emacs/Package-Installation.html][Package installation]] are usually installed using =use-package=. Some packages
are downloaded or cloned from sources outside of the ones listed below. These
packages live in =~/.emacs.d/manual-packages=. This code sets up the package
manager, adds sources and initialize the packages manager.

#+begin_src emacs-lisp :tangle init.el
  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
  			 ("melpa-stable" . "https://stable.melpa.org/packages/")
  			 ("nongnu" . "https://elpa.nongnu.org/nongnu/")
  			 ("gnu" . "https://elpa.gnu.org/packages/")))
  (setq package-user-dir (expand-file-name "~/.emacs.d/packages"))
  (require 'package)
  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))
  (package-install-selected-packages)
  (require 'use-package)
#+end_src

#+RESULTS:
: use-package

* MacOS Specifics
:PROPERTIES:
:CUSTOM_ID: macos-specifics
:ID:       B61BF246-5E1F-4AAE-9CB3-1CC59670A49E
:END:
I use a MacBook (arm) for my main laptop. I *try* to keep all the MacOS stuff
behind =when= so I can use this configuration on my Linux machines as well.

** Exec path from shell
:PROPERTIES:
:CUSTOM_ID: exec-path-from-shell
:ID:       73F551DD-200B-4DF2-AD3C-4C01903A44E4
:END:
A GNU Emacs library to ensure environment variables inside Emacs look the same
as in the user's shell.

#+begin_src emacs-lisp :tangle init.el
(when (memq window-system '(mac ns))
  (use-package exec-path-from-shell
  :ensure t
  :config
  (exec-path-from-shell-initialize)))
#+end_src

** MacOS keyboard settings
:PROPERTIES:
:CUSTOM_ID: macos-keyboard-settings
:ID:       AD2CB2D1-9217-43A0-A0D2-555B72F4C5C9
:END:
My prefered keyboard settings when on a Mac.

#+begin_src emacs-lisp :tangle init.el
  (when (eq system-type 'darwin)
    (setq mac-option-modifier 'meta
          mac-command-modifier 'super
          mac-right-option-modifier 'none)
    (global-set-key (kbd "s-c") 'kill-ring-save)
    (global-set-key (kbd "s-v") 'yank)
    (global-set-key (kbd "s-x") 'kill-region)
    (global-set-key (kbd "s-a") 'mark-whole-buffer)
    (global-set-key (kbd "s-z") 'undo)
    (global-set-key (kbd "s-f") 'isearch-forward)
    (global-set-key (kbd "s-g") 'isearch-repeat-forward)
    (global-set-key (kbd "s-o") 'find-file)
    (global-set-key (kbd "s-n") 'find-file)
    (global-set-key (kbd "s-s") 'save-buffer)
    ;(global-set-key (kbd "s-p") 'mac-preview)
    (global-set-key (kbd "s-w") 'kill-buffer)
    (global-set-key (kbd "s-m") 'iconify-frame)
    (global-set-key (kbd "s-q") 'save-buffers-kill-emacs)
    (global-set-key (kbd "s-.") 'keyboard-quit)
    (global-set-key (kbd "s-l") 'goto-line)
    (global-set-key (kbd "s-k") 'kill-buffer)
    (global-set-key (kbd "s-<up>") 'beginning-of-buffer)
    (global-set-key (kbd "s-<down>") 'end-of-buffer)
    (global-set-key (kbd "s-<left>") 'beginning-of-line)
    (global-set-key (kbd "s-<right>") 'end-of-line)
    (global-set-key [(meta down)] 'forward-paragraph)
    (global-set-key [(meta up)] 'backward-paragraph)
    )
#+end_src
* Misc settings
:PROPERTIES:
:CUSTOM_ID: misc-settings
:ID:       0836D54C-E325-4709-84E3-692BB7F718EE
:END:
Settings that doesn't fit in anywhere else.

#+begin_src emacs-lisp :tangle init.el
  (setq-default c-basic-offset 4 ; Amount of basic offset used by + and - symbols in 'c-offsets-alist'. 
  	      c-default-style "linux" ; Style which gets installed by default when a file is visited.
  	      indent-tabs-mode nil ; Don't insert tabs
  	      fill-column 80 ; Column beyond which automatic line-wrapping should happen.
            column-number-mode t ; Show column number in modeline.
  	      tab-width 4) ; Distance between tab stops, in columns.

  (tool-bar-mode -1) ; Disable the tool-bar.
  (scroll-bar-mode -1) ; Specify whether to have vertical scroll bars, and on which side.
  (menu-bar-mode t) ; I use a Mac and it looks odd if there is no menu

  (setq load-prefer-newer t) ; Non-nil means load prefers the newest version of a file.
  (setq tab-always-indent 'complete) ; Controls the operation of the TAB key.

  (delete-selection-mode 1) ; select text and delete it by typing.
  (setq org-support-shift-select t) ; Non-nil means make shift-cursor select text when possible.

  (global-hl-line-mode 1) ; Highlight the current line in Emacs.

  (setq display-line-numbers 'relative) ; Show relative line numbers
#+end_src
* Look and Feel
:PROPERTIES:
:CUSTOM_ID: look-and-feel
:ID:       74E7C440-49F1-4C6A-B8E7-D0F706B9FCCC
:END:
** Minibuffer
:PROPERTIES:
:CUSTOM_ID: minibuffer
:ID:       E53B959F-383A-4358-830D-775ED30F6878
:END:
*** Which key
:PROPERTIES:
:CUSTOM_ID: which-key
:ID:       8426C530-0A1E-4EE2-BEF4-51867EAF7B59
:END:
[[https://github.com/justbur/emacs-which-key][which-key]] is a minor mode for Emacs that displays the key bindings following your currently entered incomplete
command (a prefix) in a popup. 

#+begin_src emacs-lisp :tangle init.el
  (use-package which-key
    :ensure t
    :delight
    :custom (which-key-idle-delay 0.5)
    :config (which-key-mode))
#+end_src
*** Vertico
:PROPERTIES:
:CUSTOM_ID: vertico
:ID:       2FB254F4-A6DB-4450-8923-CABD6D949E48
:END:
[[https://github.com/minad/vertico][Vertico]] provides a performant and minimalistic vertical completion UI based on the default completion system. 

#+begin_src emacs-lisp :tangle init.el
    (use-package vertico
      :ensure t
      :init (vertico-mode)
      :bind (:map vertico-map
    	      ("C-<backspace>" . vertico-directory-up))
      :config
      (keymap-set vertico-map "?" #'minibuffer-completion-help)
      (keymap-set vertico-map "M-RET" #'minibuffer-force-complete-and-exit)
      (keymap-set vertico-map "M-TAB" #'minibuffer-complete))
#+end_src
*** Save history
:PROPERTIES:
:CUSTOM_ID: save-history
:ID:       32FA4BA0-A438-402A-8984-E739CEA64453
:END:
Vertico sorts by history position.

#+begin_src emacs-lisp :tangle init.el
  (use-package savehist
    :init
    (savehist-mode))
#+end_src
*** Marginalia
:PROPERTIES:
:CUSTOM_ID: marginalia
:ID:       2BC7F539-41DA-4BD5-91A3-A5C31559404B
:END:
[[https://github.com/minad/marginalia][Marginalia]] are marks or annotations placed at the margin of the page of a book or in this case helpful colorful
annotations placed at the margin of the minibuffer for your completion candidates.

#+begin_src emacs-lisp :tangle init.el
  (use-package marginalia
    :ensure t
    :after vertico
    :init (marginalia-mode)
    :custom
    (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil)))
#+end_src
*** Orderless
:PROPERTIES:
:CUSTOM_ID: orderless
:ID:       63F6F48E-4EBB-46A6-9AE1-0E2E0DC37653
:END:
This package provides an [[https://github.com/oantolin/orderless][orderless]] completion style that divides the pattern into space-separated components,
and matches candidates that match all of the components in any order. Each component can match in any one of several
ways: literally, as a regexp, as an initialism, in the flex style, or as multiple word prefixes. By default, regexp
and literal matches are enabled.

#+begin_src emacs-lisp :tangle init.el
  (use-package orderless
    :ensure t
    :custom
    (completion-category-defaults nil)
    (completion-category-overrides '((file (styles . (partial-completion)))))
    (completion-styles '(orderless basic)))
#+end_src
